Alie20/Embedded_systems/MCU_1/stm32f3xx_drivers/drivers/Inc/stm32f303re_USART_driver.h
/*
 * stm32f303re_USART_driver.h
 *
 *  Created on: Oct 5, 2022
 *      Author: alie
 */

#ifndef INC_STM32F303RE_USART_DRIVER_H_
#define INC_STM32F303RE_USART_DRIVER_H_

#include <stm32f303re.h>
#define USART_BUSY_IN_TX		0
#define USART_BUSY_IN_RX		1
#define USART_BUSY_IN_READY		2

#define USART_EVENT_TX_COMPLT	1
#define USART_EVENT_RX_COMPLT	2
#define USART_EVENT_CTS			3
#define USART_EVENT_IDLE		4
#define USART_EVENT_ORE			5
#define USART_ERREVENT_FE		6
#define USART_ERREVENT_NF		7
#define USART_ERREVENT_ORE		8



typedef struct
{
	uint8_t USART_Mode;
	uint32_t USART_Baud;
	uint8_t USART_NoOfStopBits;
	uint8_t USART_WordLength;
	uint8_t USART_ParityControl;
	uint8_t USART_HwFlowControl;
}USART_Config_t;

typedef struct
{
	USART_RegDef_t *pUSARTx;
	USART_Config_t USART_Config;
	uint8_t *pTxBuffer;			// Tx buffer Address
	uint8_t *pRxBuffer;			// Rx Buffer Address
	uint32_t TxLen;				// Store Tx Len
	uint32_t RxLen;				// Store Rx Len
	uint8_t  TxState;			// Store Communication state
	uint8_t  RxState;
}USART_Handle_t;

/*
 *@USART_Mode
 *Possible options for USART_Mode
 */
#define USART_MODE_ONLY_TX 0
#define USART_MODE_ONLY_RX 1
#define USART_MODE_TXRX  2

/*
 *@USART_Baud
 *Possible options for USART_Baud
 */
#define USART_STD_BAUD_1200					1200
#define USART_STD_BAUD_2400					400
#define USART_STD_BAUD_9600					9600
#define USART_STD_BAUD_19200 				19200
#define USART_STD_BAUD_38400 				38400
#define USART_STD_BAUD_57600 				57600
#define USART_STD_BAUD_115200 				115200
#define USART_STD_BAUD_230400 				230400
#define USART_STD_BAUD_460800 				460800
#define USART_STD_BAUD_921600 				921600
#define USART_STD_BAUD_2M 					2000000
#define USART_STD_BAUD_3M 					3000000


/*
 *@USART_ParityControl
 *Possible options for USART_ParityControl
 */
#define USART_PARITY_EN_ODD   2
#define USART_PARITY_EN_EVEN  1
#define USART_PARITY_DISABLE   0

/*
 *@USART_WordLength
 *Possible options for USART_WordLength
 */
#define USART_WORDLEN_8BITS	  0
#define USART_WORDLEN_9BITS	  1
#define USART_WORDLEN_7BITS   2

/*
 *@USART_NoOfStopBits
 *Possible options for USART_NoOfStopBits
 */
#define USART_STOPBITS_1     0
#define USART_STOPBITS_0_5   1
#define USART_STOPBITS_2     2
#define USART_STOPBITS_1_5   3

/*
 *@USART_HWFlowControl
 *Possible options for USART_HWFlowControl
 */
#define USART_HW_FLOW_CTRL_NONE    	0
#define USART_HW_FLOW_CTRL_CTS    	1
#define USART_HW_FLOW_CTRL_RTS    	2
#define USART_HW_FLOW_CTRL_CTS_RTS	3


/*
 * Init and De-init
 */
void USART_Init(USART_Handle_t *pUSARTHandle);
void USART_DeInit(USART_RegDef_t *pUSARTx);


/*
 * Data Send and Receive
 */
void USART_SendData(USART_Handle_t *pUSARTHandle,uint8_t *pTxBuffer, uint32_t Len);
void USART_ReceiveData(USART_Handle_t *pUSARTHandle, uint8_t *pRxBuffer, uint32_t Len);
uint8_t USART_SendDataIT(USART_Handle_t *pUSARTHandle,uint8_t *pTxBuffer, uint32_t Len);
uint8_t USART_ReceiveDataIT(USART_Handle_t *pUSARTHandle, uint8_t *pRxBuffer, uint32_t Len);

/*
 * PeriClockControl
 */
void USART_PeriClockControl(USART_RegDef_t *pUSARTx,uint8_t EnorDi);

// Peripheral_Control
void USART_PeripheralControl(USART_RegDef_t *pUSARTx,uint8_t EnorDi);

// GetFlagStatus
uint8_t USART_GetFlagStatus(USART_RegDef_t *pUSARTx,uint8_t StatusFlagname);

// Clear_Flag
void USART_ClearFlag(USART_RegDef_t *pUSARTx,uint8_t StatusFlagName);

// IRQInterruptConfig
void USART_IRQInterruptConfig(uint8_t IRQNumber, uint8_t EnorDi);

//IRQPeriortyconfig
void USART_IRQInterruptPeriority(uint8_t IRQNumber, uint32_t IRQPeriority);

//IRQHandling
void USART_IRQHandling(USART_Handle_t *pHandle);

//Calculate BaudRate
void USART_SetBaudRate(USART_RegDef_t *pUSARTx, uint32_t BaudRate);

void USART_ApplicationEventCallback(USART_Handle_t *pHandle,uint8_t event);


#endif /* INC_STM32F303RE_USART_DRIVER_H_ */
